SELECT Ст.Фамилия, Ст.Рег_номер, Сп.Направление, Ка.Название AS Название_кафедры FROM
Студент AS Ст INNER JOIN Специальность AS Сп ON Ст.Номер = Сп.Номер
INNER JOIN Кафедра AS Ка ON Сп.Шифр = Ка.Шифр; -- 1 задание

SELECT Ка.Факультет, Ка.Шифр, Ка.Название, Со.Фамилия 
FROM Кафедра AS Ка INNER JOIN Сотрудник AS Со ON Ка.Шифр = Со.Шифр
INNER JOIN Специальность AS Сп ON Сп.Шифр = Ка.Шифр WHERE Со.Должность = N'зав. кафедрой'; -- 2 задание


SELECT 
    СоЛ.Таб_номер AS [Номер сотрудника], 
    СоЛ.Фамилия AS [Сотрудник], 
    СоП.Таб_номер AS [Номер руководителя], 
    СоП.Фамилия AS [Руководитель]
FROM 
    Сотрудник AS СоЛ 
    LEFT JOIN Сотрудник AS СоП ON СоЛ.Шеф = СоП.Таб_номер AND СоЛ.Таб_номер <> СоЛ.Шеф; -- 3 задание


SELECT Ст.Рег_номер, Ст.Фамилия, COUNT(Э.Код) AS [Количество сданных экзаменов] FROM Студент AS Ст
INNER JOIN Экзамен AS Э ON Ст.Рег_номер = Э.Рег_номер GROUP BY Ст.Рег_номер, Ст.Фамилия HAVING COUNT(Э.Код) >= 2; -- 4 задание


SELECT Фамилия, Должность, Зарплата FROM Сотрудник WHERE Должность = N'инженер' AND Зарплата < 20000;


SELECT Ст.Рег_номер, Ст.Фамилия FROM Экзамен AS Эк INNER JOIN Студент AS Ст ON Эк.Рег_номер = Ст.Рег_номер WHERE Эк.Аудитория = N'т505';


SELECT Ст.Рег_номер, Ст.Фамилия, COUNT(Э.Оценка), AVG(CAST(Э.Оценка AS FLOAT))
FROM Студент AS Ст INNER JOIN Экзамен AS Э ON Ст.Рег_номер = Э.Рег_номер
GROUP BY Ст.Рег_номер, Ст.Фамилия
HAVING AVG(CAST(Э.Оценка AS FLOAT)) >= 4;


SELECT Сот.Фамилия, Сот.Зарплата, Пре.Степень FROM Сотрудник AS Сот INNER JOIN Преподаватель AS Пре ON Сот.Таб_номер = Пре.Таб_номер WHERE Сот.Должность = N'зав. кафедрой';


SELECT Сот.Таб_номер, Сот.Фамилия FROM Сотрудник AS Сот INNER JOIN Преподаватель AS Пре ON Сот.Таб_номер = Пре.Таб_номер WHERE Пре.Звание = N'профессор';


SELECT DISTINCT
Д.Название AS Дисциплина,
С.Фамилия,
С.Должность,
П.Степень,
Э.Дата,
Э.Аудитория
FROM Экзамен AS Э
INNER JOIN Дисциплина AS Д ON Э.Код = Д.Код
INNER JOIN Сотрудник AS С ON Э.Таб_номер = С.Таб_номер
INNER JOIN Преподаватель AS П ON Э.Таб_номер = П.Таб_номер
WHERE 
Э.Дата BETWEEN '2015-06-05' AND '2015-06-10'
ORDER BY 
Э.Дата;



SELECT 
С.Фамилия,
COUNT(Э.Дата) AS [Количество принятых экзаменов]
FROM Экзамен As Э INNER JOIN Сотрудник С ON Э.Таб_номер = С.Таб_номер
GROUP BY С.Фамилия
HAVING COUNT(Э.Дата) > 3;




SELECT 
С.Рег_номер,
С.Фамилия
FROM Студент AS С LEFT OUTER JOIN Экзамен AS Э ON С.Рег_номер = Э.Рег_номер AND Э.Дата = '2015-06-05' -- дату сами указываем
WHERE Э.Рег_номер IS NULL;